cask_args appdir: '/Applications'

brew "bash"
brew "coreutils"
brew "svn"
brew "zsh"
brew "perl"
brew "grep"
brew "openssh"
brew "git"
brew "tmux"
brew "gnupg"
brew "z"
brew "openssl"
brew "wget"
brew "diff-so-fancy"
brew "fzf"
brew "git-lfs"
brew "httpie"
brew "jq"
brew "m-cli"
brew "mas"
brew "ssh-copy-id"
brew "terminal-notifier"
brew "task"
brew "fzy"
brew "tree"
brew "mycli"
brew "autojump"
brew "gh"
brew "thefuck"
brew "colordiff"
brew "ranger"
brew "htop"
brew "go"
brew "neovim"
brew "gitui"
brew "pinentry-mac"
brew "fortune"
brew "figlet"
brew "lolcat"
brew "ccat"
brew "navi"
brew "ffmpeg"
brew "bat"
brew "ox"
brew "mdcat"
brew "xplr"
brew "glow"
brew "lsd"
brew "fd"
brew "sqlite"
brew "zlib"
brew "zoxide"
brew "git-delta"
brew "lazygit"
brew "eza"
brew "assh"
brew "procs"
brew "ripgrep"
brew "nnn"
brew "pnpm"
brew "vivid"
brew "jump"
brew "imagemagick"
brew "nss"
brew "shfmt"
brew "shellcheck"
brew "atuin"
brew "poppler"
brew "sevenzip"
brew "helix"
brew "yazi"
brew "btop"
# brew "elastic/tap/elasticsearch-full"
# brew "khanhas/tap/spicetify-cli"
# brew "switchaudio-osx"
# brew "bluetoothconnector"
# brew "mkcert"

# Development
brew "php"
# brew "php@8.5"
brew "nginx"
brew "php-cs-fixer"
brew "mariadb"
brew "redis"
brew "composer"
brew "pyenv"
# brew "wp-cli"
# brew "shopify-cli"
# brew "theme-check"

cask "alfred"
cask "firefox@developer-edition"
cask "firefox@nightly"
cask "google-chrome"
cask "iterm2@nightly"
cask "spotify"
cask "1password-cli" # was brew "1password-cli@beta" (now a cask, beta removed)
cask "1password@beta"
cask "brooklyn"
cask "carbon-copy-cloner"
cask "aerial"
cask "visual-studio-code"
cask "insomnia"
cask "github"
cask "little-snitch"
cask "kitty"
# cask "phpmon"
cask "obsidian"
cask "runjs"
cask "tabby"
cask "raycast"
cask "warp"
cask "rectangle-pro"
cask "omnidisksweeper"
cask "hyper"
cask "etrecheckpro"
cask "easyfind"
cask "appcleaner"
cask "raindropio"
cask "alt-tab"
cask "iina"
cask "arc"
cask "jetbrains-toolbox"
cask "zen" # renamed from zen-browser
cask "mist"
cask "chatgpt"
cask "claude"
cask "flyenv"
cask "onyx"
cask "cloudflare-warp"
cask "adguard"
cask "kiro-cli" # renamed from amazon-q
cask "balenaetcher"
cask "brave-browser"
cask "helium-browser"
cask "jetbrains-toolbox"
cask "kiro-cli"
cask "microsoft-office"
cask "microsoft-teams"
cask "micro-snitch"
cask "ngrok"
cask "rio"

# cask "ghostty"
# cask "wins"
# cask "zed"
# cask "zen"
# cask "cursor"
# cask "vscodium"
# cask "fman"
# cask "figma"
# cask "replacicon"
# cask "utm@beta"
# cask "monitorcontrol"
# cask "sketch"
# cask "forkLift"
# cask "zeplin"
# cask "karabiner-elements"
# cask "hammerspoon"

## Fonts
cask "font-fira-code"
cask "font-monaspace"
cask "font-symbols-only-nerd-font"


