cask_args appdir: '/Applications'

tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "homebrew/cask"
tap "homebrew/core"
tap "shivammathur/php"
tap "nicoverbruggen/cask"

brew "bash"
brew "coreutils"
brew "svn"
brew "zsh"
brew "perl"
brew "grep"
brew "openssh"
brew "git"
brew "tmux"
brew "gnupg"
brew "z"
brew "openssl"
brew "wget"
brew "neofetch"
brew "diff-so-fancy"
brew "fzf"
brew "git-lfs"
brew "httpie"
brew "jq"
brew "m-cli"
brew "mas"
brew "ssh-copy-id"
brew "terminal-notifier"
brew "task"
brew "fzy"
brew "tree"
brew "mycli"
brew "autojump"
brew "gh"
brew "thefuck"
brew "colordiff"
brew "ranger"
brew "htop"
brew "go"
brew "neovim"
brew "gitui"
brew "pinentry-mac"
brew "fortune"
brew "figlet"
brew "lolcat"
brew "ccat"
brew "navi"
brew "ffmpeg"
brew "bat"
brew "ox"
brew "mdcat"
brew "xplr"
brew "glow"
brew "lsd"
brew "fd"
brew "sqlite"
brew "zlib"
brew "zoxide"
brew "mcfly"
brew "asdf"
brew "git-delta"
brew "exa"
brew "assh"
brew "procs"
brew "dog"
brew "ripgrep"
brew "nnn"
brew "pnpm"
brew "vivid"
brew "jump"
brew "imagemagick"
brew "mkcert"
brew "nss"
brew "shfmt"
brew "shellcheck"
brew "broot"
brew "khanhas/tap/spicetify-cli"

# Development
brew "nvm"
brew "php"
brew "php@8.0"
brew "php@7.4"
brew "nginx"
brew "php-cs-fixer"
brew "mariadb"
brew "redis"
brew "composer"
brew "pyenv"
brew "wp-cli"

cask "alfred"
cask "firefox-developer-edition"
cask "firefox-nightly"
cask "google-chrome"
cask "brave-browser"
cask "iterm2-nightly"
cask "spotify"
cask "karabiner-elements"
brew "1password-cli-beta"
cask "1password-beta"
cask "brooklyn"
cask "carbon-copy-cloner"
cask "aerial"
cask "hammerspoon"
cask "visual-studio-code"
cask "insomnia"
cask "github"
cask "little-snitch"
cask "onyx"
cask "forkLift"
cask "zeplin"
cask "messenger"
cask "kitty"
cask "phpmon"
cask "sketch"
cask "obsidian"
cask "runjs"
cask "tabby"
cask "raycast"
cask "warp"
cask "gitkraken"
cask "fig"
cask "monitorcontrol"
cask "murus"
cask "vallum"
cask "rectangle-pro"
cask "replacicon"
cask "utm-beta"
cask "omnidisksweeper"
cask "figma"
cask "hyper"
cask "tower"
cask "etrecheckpro"
cask "easyfind"
cask "appcleaner"
cask "pushplaylabs-sidekick"
cask "qbittorrent"
cask "raindropio"
cask "transmission-nightly"
cask "vscodium"
cask "sigmaos"
cask "fman"
cask "fontbase"
cask "altserver"
cask "framer"
cask "alt-tab"
